run_files/fixed_ucb/ucb1/backGround/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;

    //default 	     cellLimited leastSquares 1;
    default 	     cellLimited Gauss linear 1;

    //grad(U) 	     cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    //div(phi,U)      	Gauss linear;
    //div(phi,U)      	Gauss limitedLinearV 1;
    div(phi,U)      	Gauss linearUpwindV default;
    //div(phi,U)      	Gauss upwind;

    div(phi,omega) 		Gauss linearUpwind default;
    div(phi,epsilon) 	Gauss linearUpwind default;
    div(phi,k) 			Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

oversetInterpolation
{
    method          inverseDistance;
}

wallDist
{
    method meshWave;
}

/*
fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}
*/

// ************************************************************************* //
